# Gözlem ve Değişken Seçimi : loc & iloc

In [11]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])

In [13]:
df

   var1  var2  var3
0     6    26    12
1    25    18    28
2     3    17    15
3     2    28    17
4     4    13    25
5    24    26     9
6    21     7     2
7    17    15    27
8     3    16    24
9    29    28     8

In [15]:
# loc: tanımlandığı şekliyle seçim yapmak için kullanılır

In [17]:
df.loc[0:3]

   var1  var2  var3
0     6    26    12
1    25    18    28
2     3    17    15
3     2    28    17

In [19]:
#iloc: alışık olduğumuz indexleme mantığı ile seçim yapar

In [21]:
df.iloc[0:3]

   var1  var2  var3
0     6    26    12
1    25    18    28
2     3    17    15

In [23]:
df.iloc[0,0]

6

In [27]:
df

   var1  var2  var3
0     6    26    12
1    25    18    28
2     3    17    15
3     2    28    17
4     4    13    25
5    24    26     9
6    21     7     2
7    17    15    27
8     3    16    24
9    29    28     8

In [25]:
df.iloc[:3,:2]

   var1  var2
0     6    26
1    25    18
2     3    17